note/note-iptables.org
#+SETUPFILE: setup.org
#+TITLE: iptables笔记


* iptables的工作机制
  #+BEGIN_QUOTE
     首先列出iptables在linux内核中涉及的五个位置：

     1.内核空间中：从一个网络接口进来，到另一个网络接口去的
     2.数据包从内核流入用户空间的
     3.数据包从用户空间流出的
     4.进入/离开本机的外网接口
     5.进入/离开本机的内网接口
     
     这五个位置也被称为五个钩子函数（hook functions）,也叫五个规则链。

     1.PREROUTING (路由前)
     2.INPUT (数据包流入口)
     3.FORWARD (转发管卡)
     4.OUTPUT(数据包出口)
     5.POSTROUTING（路由后）

     这是NetFilter规定的五个规则链，任何一个数据包，只要经过本机，必将经过这五个链中的其中一个链。 

  #+END_QUOTE

  
* iptables规则写法

  #+BEGIN_QUOTE

  iptables定义规则的方式比较复杂: 

  格式：iptables [-t table] COMMAND chain CRETIRIA -j ACTION 

  -t table ：3个filter nat mangle 

  COMMAND：定义如何对规则进行管理 

  chain：指定你接下来的规则到底是在哪个链上操作的，当定义策略的时候，是可以省略的 

  CRETIRIA:指定匹配标准 

  -j ACTION :指定如何进行处理

  #+END_QUOTE

* shell
  
  https://teakki.com/p/57dbca1f9ac8537410f10303

  https://wsgzao.github.io/post/iptables/