note/note-iptables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-24 Thu 12:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="preamble" class="status">
<a href="https://www.manue1.site/index.html">Home</a>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org724435f">iptables的工作机制</a></li>
<li><a href="#org46d3dcc">iptables规则写法</a></li>
<li><a href="#org9d98e14">shell</a></li>
</ul>
</div>
</div>
<div id="outline-container-org724435f" class="outline-2">
<h2 id="org724435f">iptables的工作机制</h2>
<div class="outline-text-2" id="text-org724435f">
<blockquote>
<p>
首先列出iptables在linux内核中涉及的五个位置：
</p>

<p>
1.内核空间中：从一个网络接口进来，到另一个网络接口去的
2.数据包从内核流入用户空间的
3.数据包从用户空间流出的
4.进入/离开本机的外网接口
5.进入/离开本机的内网接口
</p>

<p>
这五个位置也被称为五个钩子函数（hook functions）,也叫五个规则链。
</p>

<p>
1.PREROUTING (路由前)
2.INPUT (数据包流入口)
3.FORWARD (转发管卡)
4.OUTPUT(数据包出口)
5.POSTROUTING（路由后）
</p>

<p>
这是NetFilter规定的五个规则链，任何一个数据包，只要经过本机，必将经过这五个链中的其中一个链。 
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org46d3dcc" class="outline-2">
<h2 id="org46d3dcc">iptables规则写法</h2>
<div class="outline-text-2" id="text-org46d3dcc">
<blockquote>
<p>

</p>

<p>
iptables定义规则的方式比较复杂: 
</p>

<p>
格式：iptables [-t table] COMMAND chain CRETIRIA -j ACTION 
</p>

<p>
-t table ：3个filter nat mangle 
</p>

<p>
COMMAND：定义如何对规则进行管理 
</p>

<p>
chain：指定你接下来的规则到底是在哪个链上操作的，当定义策略的时候，是可以省略的 
</p>

<p>
CRETIRIA:指定匹配标准 
</p>

<p>
-j ACTION :指定如何进行处理
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org9d98e14" class="outline-2">
<h2 id="org9d98e14">shell</h2>
<div class="outline-text-2" id="text-org9d98e14">
<p>
<a href="https://teakki.com/p/57dbca1f9ac8537410f10303">https://teakki.com/p/57dbca1f9ac8537410f10303</a>
</p>

<p>
<a href="https://wsgzao.github.io/post/iptables/">https://wsgzao.github.io/post/iptables/</a></p>
</div>
</div>
</div>
</body>
</html>